[
    {
        "date": "07/07/2023T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "nice needs undating husband stayed inn market celebrate birthday overall stay wonderful, enjoyed two-story suite incredible view market sound, quiet location perfect, complaint hotel needs better job keeping maintainance, room major scratches walls stains carpets, cracks bathroom tile significant signs wear bathroom, price expected regards quality upkeep, hopefully management pay attention keeping lovely hotel fresh lovely",
        "rating":"4",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "04/12/2022T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "Took advantage of the downtown location to walk to dinner, check out a couple galleries, and have drinks. It was great. Service top notch as always. Bed comfort can not be beat.",
        "rating":"4",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "02/10/2023T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "They were extremely accommodating and allowed us to check in early at like 10am. We got to hotel super early and I didn’t wanna wait. So this was a big plus. The sevice was exceptional as well. Would definitely send a friend there.",
        "rating":"5",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "03/12/2021T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "The rooms were clean, very comfortable, and the staff was amazing. They went over and beyond to help make our stay enjoyable. I highly recommend this hotel for anyone visiting downtown (L).",
        "rating":"5",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "02/04/2020T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "I had a wonderful experience at the (HN). Every staff member I encountered, from the valet to the check- in to the cleaning staff were delightful and eager to help! Thank you! Will recommend to my colleagues!",
        "rating":"4",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "10/12/2022T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "The staff at this property are all great! They all go above and beyond to make your stay comfortable. Please (HN) give your staff awards!",
        "rating":"5",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "08/12/2018T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "The rooms stink. They are not clean. I requested a non smoking room and both rooms smelled like smoke. Bathrooms were gross and bugs were everywhere! ! The door did not seem secure and was not evened out so bugs got in easily. The second room was full of gnats. The neighbours had police visit them 2 nights in a row. They were loud.",
        "rating":"2",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "06/08/2019T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "I was told that my room would have several amenities like microwave and a.c. unfortunately There was only a mini fridge in my room and the air conditioner didn’t work at all which is and was a problem in 100⁰ weather.",
        "rating":"2",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "06/10/2020T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "First the lady that checks you in has a very bad attitude and is very rude, now the room was disgusting it was roached infested whoever is supposed to clean there doesn’t care they step on the roaches and leaves them there it was very dirty I wish I could upload the pictures I took and the videos, I couldn’t even sleep there I called the front desk and told them the lady said if you don’t like it leave I said yea I will just give me my money back she laughed and hung up I’ll never come back here again!!",
        "rating":"1",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },
    {
        "date": "02/12/2022T00:00:00",
        "locationName": "Arno Run Stratford",
        "desc": "Walking distance to everything downtown. Beautiful rooms, great ambiance in the hotel dining room and bar. We didn’t eat so I can’t rate the food, although others looked like they were enjoying it! We will come again!",
        "rating":"4",
        "address": "4404 Arno Run,Stratford, Texas - 24620, United States",
        "country": "United States"
    },



    {
        "date": "04/11/2021T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "The staff was great. The receptionists were very helpful and answered all our questions. The room was clean and bright, and the room service was always on time. Will be coming back! Thank you so much.",
        "rating":"4",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "03/11/2020T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "I recently had the pleasure of staying at Eight Foot, and it was an unforgettable experience. From the moment I arrived, the staff went above and beyond to ensure my comfort and satisfaction. The luxurious accommodations, coupled with exceptional service, made my stay truly memorable. The hotel’s prime location made exploring the city a breeze, and I can’t wait to return to Eight Foot on my next visit. Highly recommended!",
        "rating":"5",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "11/11/2018T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "My stay at Eight Foot was nothing short of spectacular. The hotel’s elegant design, combined with its top-notch amenities, made for a truly relaxing and enjoyable experience. The attentive and courteous staff catered to my every need, ensuring that my stay was as comfortable as possible. With its convenient location and outstanding service, Eight Foot has quickly become my go-to choice for accommodations whenever I travel to the area. 5 star!",
        "rating":"5",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "10/10/2020T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "The staff at the (HN) in downtown (L) were fantastic. Great attitude. Helpful, and always available. The bed was super comfy. I will always stay at this location when traveling to or through (L)",
        "rating":"4",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "01/12/2019T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "The staff was the nicest staff I have ever encountered at a hotel. They were always friendly and asked how our stay was going every time we walked in the door. They also were able to recommend places to get any type of meal that we needed as well.",
        "rating":"5",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "03/12/2021T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "Love the charm of this hotel. Does not give you the routine chain hotel vibe at all. While I did not get there in time to eat at restaurant, have heard amazing reviews on the restaurant",
        "rating":"5",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "05/11/2020T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "The bed was extremely comfortable. The room was spacious and clean. The vintage aesthetics were awesome. Wish we weren’t just passing through!",
        "rating":"4",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "02/12/2022T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "Nice hotel expensive parking got good deal stay hotel anniversary, arrived late evening took advice previous reviews did valet parking, check quick easy, little disappointed non-existent view room room clean nice size, bed comfortable woke stiff neck high pillows, not soundproof like heard music room night morning loud bangs doors opening closing hear people talking hallway, maybe just noisy neighbors, aveda bath products nice, did not goldfish stay nice touch taken advantage staying longer, location great walking distance shopping, overall nice experience having pay 40 parking night.",
        "rating":"3",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "01/12/2018T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "The room was disgusting! Very dirty. You could see foot prints on the floor where other people walked! It looked as though it had not been swept in a very long time! Seemed like a good room for smoking crack",
        "rating":"1",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "country": "United States"
    },
    {
        "date": "03/11/2021T00:00:00",
        "locationName": "Borer Lodge O'Connerfort",
        "desc": "Room was dirty. Tub wasn’t clean there was someone else’s old dirty washcloth still hanging in the shower. Floor was beyond filthy. Ashes from previous guest still on nightstand I believe the only thing they did in the room was make the bed and put fresh towels in. Left as early as possible because we just wanted to get out of there because we couldn’t cancel unfortunately due to the fact we came all the way from (City) and by the time we saw the room it was too late to cancel. I even tried calling to get my money back which didn’t work. Definitely wouldn’t stay here again or recommend it to anyone. First night there was children running back and forth past the door until almost 1 in the morning. It was just horrible",
        "address": "33420 Borer Lodge,O'Connerfort, Texas - 07870, United States",
        "rating":"2",
        "country": "United States"
    },
    

    {
        "date": "02/11/2020T00:00:00",
        "locationName": "Charles Mill New Braunfels",
        "desc": "ok nothing special charge diamond member hilton decided chain shot 20th anniversary seattle, start booked suite paid extra website description not, suite bedroom bathroom standard hotel room, took printed reservation desk showed said things like tv couch ect desk clerk told oh mixed suites description kimpton website sorry free breakfast, got kidding, embassy suits sitting room bathroom bedroom unlike kimpton calls suite, 5 day stay offer correct false advertising, send kimpton preferred guest website email asking failure provide suite advertised website reservation description furnished hard copy reservation printout website desk manager duty did not reply solution, send email trip guest survey did not follow email mail, guess tell concerned guest.the staff ranged indifferent not helpful, asked desk good breakfast spots neighborhood hood told no hotels, gee best breakfast spots seattle 1/2 block away convenient hotel does not know exist, arrived late night 11 pm inside run bellman busy chating cell phone help bags.prior arrival emailed hotel inform 20th anniversary half really picky wanted make sure good, got nice email saying like deliver bottle champagne chocolate covered strawberries room arrival celebrate, told needed foam pillows, arrival no champagne strawberries no foam pillows great room view alley high rise building good not better housekeeping staff cleaner room property, impressed left morning shopping room got short trips 2 hours, beds comfortable.not good ac-heat control 4 x 4 inch screen bring green shine directly eyes night, light sensitive tape controls.this not 4 start hotel clean business hotel super high rates, better chain hotels seattle",
        "address": "459 Charles Mill,New Braunfels, Iowa -06863-5659, United States",
        "rating":"2",
        "country": "United States"
    },
    {
        "date": "01/11/2021T00:00:00",
        "locationName": "Charles Mill New Braunfels",
        "desc": "good choice hotel recommended sister, great location room nice, comfortable bed- quiet- staff helpful recommendations restaurants, pike market 4 block walk, stay",
        "address": "459 Charles Mill,New Braunfels, Iowa -06863-5659, United States",
        "rating":"3",
        "country": "United States"
    },
    {
        "date": "10/11/2023T00:00:00",
        "locationName": "Charles Mill New Braunfels",
        "desc": "loved, stayed warwick overnight getway enjoy christmas shopping, warwick exceeded expectations, staff wonderful extrememly friendly room clean service lounge wonderful, came contact hotel friendly, women bathroom lever lounge well.. think haunted totally creepy vibe lights anywho, really enjoyed stay going couple days",
        "address": "459 Charles Mill,New Braunfels, Iowa -06863-5659, United States",
        "rating":"5",
        "country": "United States"
    },
    {
        "date": "01/11/2018T00:00:00",
        "locationName": "Charles Mill New Braunfels",
        "desc": "great stay great stay, went seahawk game awesome, downfall view building did n't complain, room huge staff helpful, booked hotels website seahawk package, no charge parking got voucher taxi, problem taxi driver did n't want accept voucher barely spoke english, funny thing speak arabic called started making comments girlfriend cell phone buddy, took second realize just said fact speak language face priceless, ass told, said large city, told head doorman issue called cab company promply answer did n't, apologized offered pay taxi, bucks 2 miles stadium, game plan taxi return going humpin, great walk did n't mind, right christmas wonderful lights, homeless stowed away building entrances leave, police presence not greatest area stadium, activities 7 blocks pike street waterfront great coffee shops way, hotel mantained foyer awesome, wine tasting available evening, best dog, taking st. bernard time family, safes hotel located service desk room, bathroom huge jetted tub huge, funny house keeping walked girlfriend getting dressed, did n't hear knock doing turn service, screamed girlfriend screams hit floor laughing, started talking spanish worked, place recommend price, check online deals just good not better, besite contains deals vouchers travel websites n't tell",
        "address": "459 Charles Mill,New Braunfels, Iowa -06863-5659, United States",
        "rating":"5",
        "country": "United States"
    },
    {
        "date": "12/09/2022T00:00:00",
        "locationName": "Charles Mill New Braunfels",
        "desc": "not bad location unmatchable price range, simple sleeping room 80 expect pay 2x, surprisingly cleaner hotels seen past week driving la staying travelodge days inn motel 6. quality furnishings high, sure little run spots just old building usual character flaws none affected comfort, lucky corner room especially nice look w know paying 250+/night, bath worked n't care watch tv vacation no idea worked want believe comments feel free, mean room come",
        "address": "459 Charles Mill,New Braunfels, Iowa -06863-5659, United States",
        "rating":"3",
        "country": "United States"
    },
    {
        "date": "04/10/2019T00:00:00",
        "locationName": "Charles Mill New Braunfels",
        "desc": "bad choice, booked hotel hot wire called immediately requesting nonsmoking room king bed room away elevator/ice.the person spoke pleasant stated not guarantee requests honored make note reservation, check-in person desk rude said no special request noted reservation card andstated no king beds way reservation stuck 2 double beds, located directly accross elevator ice, nonsmoking, no elevator parking garage hotel, warwick mats garage filthy stairwells, hotel faces 4th smells urine, carpets registration elevator area need cleaning, upholstery curtains room needed cleaning andpressing sign bathroom water conservation tub facet dripped continuously, tub drain needsattention shower curtain holes, no coffee maker room, bedding did not fit bed sleeping directly mattress bedding askew, staff unfriendly short, housekeeping staff quite pleasant, stay hotel",
        "address": "459 Charles Mill,New Braunfels, Iowa -06863-5659, United States",
        "rating":"1",
        "country": "United States"
    }

]