[
    {
        "date": "05/02/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I had a wonderful stay at the Marriott Hotel in NYC. The room was spacious and clean, with a comfortable bed and beautiful views of the city. The staff was friendly and accommodating, and the amenities were top-notch. The location was perfect for exploring Hollywood and the surrounding areas. I highly recommend this hotel to anyone visiting NYC.",
        "rating": 4,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "09/02/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I recently stayed at the Marriott Hotel in NYC and it was a fantastic experience. The location was perfect for exploring the city, with easy access to all the major attractions. The staff was friendly and knowledgeable, and the room was spacious and clean. The rooftop bar had amazing views of the city and the drinks were delicious. I would definitely stay here again.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "12/02/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I had a wonderful stay at the Marriott Hotel in New York City. The location was perfect, right on the beach with beautiful ocean views. The room was spacious and clean, with a comfortable bed and all the amenities I needed. The pool area was amazing, with plenty of lounge chairs and umbrelNYCs. The staff was friendly and helpful, making my stay even more enjoyable.",
        "rating": 4,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "03/15/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I recently stayed at the Marriott Hotel in New York and it was a great experience. The location was perfect, right in the heart of downtown with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and accommodating, and the amenities were top-notch. I would definitely stay here again.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "03/18/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I had a fantastic stay at the Marriott Hotel in New York. The location was perfect, right in the heart of downtown with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and knowledgeable, and the amenities were top-notch. I would highly recommend this hotel to anyone visiting New York.",
        "rating": 4,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "03/22/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I recently stayed at the Marriott Hotel in NYC and it was a great experience. The location was perfect, right in the heart of downtown with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and accommodating, and the amenities were top-notch. I would definitely stay here again.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "03/25/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had an amazing stay at the Marriott Hotel in Vegas. The location was perfect, right on the strip with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The pool area was amazing, with plenty of lounge chairs and umbrellas. The staff was friendly and knowledgeable, and the amenities were top-notch. I would definitely stay here again and highly recommend this hotel to anyone visiting Vegas.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/03/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I had a fantastic stay at the Marriott Hotel in NYC. The location was perfect, right in the heart of the city with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and knowledgeable, and the amenities were top-notch. I would highly recommend this hotel to anyone visiting NYC.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "05/03/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I recently stayed at the Marriott Hotel in NYC and had an amazing experience. The location was perfect for exploring Hollywood and the surrounding areas. The room was spacious and clean, with beautiful views of the city. The staff was friendly and accommodating, and the amenities were top-notch. I would highly recommend this hotel to anyone visiting NYC.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "09/03/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I had a fantastic stay at the Marriott Hotel in NYC. The location was perfect, right in the heart of downtown with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and accommodating, and the amenities were top-notch. I would definitely stay here again.",
        "rating": 4,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "12/03/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I recently stayed at the Marriott Hotel in New York City and had a wonderful experience. The location was perfect, right on the beach with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the ocean. The staff was friendly and helpful, and the amenities were top-notch. I would highly recommend this hotel to anyone visiting New York City.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "04/15/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I had a great stay at the Marriott Hotel in NYC. The location was perfect, right in the heart of downtown with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and accommodating, and the amenities were top-notch. I would definitely stay here again.",
        "rating": 4,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "04/18/2021T00:00:00",
        "locationName": "Marriott Hotel NYC",
        "desc": "I recently stayed at the Marriott Hotel in New York and had a wonderful experience. The location was perfect, right in the heart of downtown with easy access to all the major attractions. The room was spacious and clean, with beautiful views of the city. The staff was friendly and helpful, and the amenities were top-notch. I would highly recommend this hotel to anyone visiting New York.",
        "rating": 5,
        "address": "123 Broadway,New York, New York - 76867, United States",
        "country": "USA"
    },
    {
        "date": "01/05/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a fantastic stay at Marriott Hotel Vegas! The location is perfect - right on the strip and within walking distance to many attractions. The room was spacious, clean, and comfortable. The amenities were top-notch, including the pool, fitness center, and on-site restaurant. The staff was friendly, attentive, and accommodating. I would highly recommend this hotel to anyone visiting Las Vegas!",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/15/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "While my stay at Marriott Hotel Vegas was generally pleasant, the nearby construction noise was a bit disruptive. However, the room itself was clean and comfortable, with all the necessary amenities. The hotel staff was friendly and helpful throughout my stay. The location is great, right on the strip and close to many attractions. Overall, I would recommend this hotel for its value and convenience.",
        "rating": 3.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "04/20/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had mixed feelings about my stay at Marriott Hotel Vegas. While the room was spacious and clean, the check-in process was slow and disorganized. The hotel amenities were average, with nothing particularly noteworthy. However, the staff was friendly and helpful when I needed assistance. The location is great, right on the strip and within walking distance to many attractions. Overall, I would recommend this hotel for its location and decent value.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/02/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I was somewhat disappointed with my stay at Marriott Hotel Vegas. While the location was great, right on the strip and close to many attractions, the room was small and the bed was uncomfortable. The hotel amenities were average, with nothing particularly memorable. The staff was friendly and helpful, but it wasn't enough to offset the other shortcomings. Overall, I would recommend this hotel only for its location.",
        "rating": 2.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/01/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Marriott Hotel Vegas was a decent stay overall, although the ongoing renovations made for a bit of a noisy experience. The renovated room was modern and comfortable, with all the necessary amenities. The hotel staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions. Overall, I would recommend this hotel once the renovations are complete.",
        "rating": 3.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "11/30/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had an amazing stay at Marriott Hotel Vegas! The staff was incredibly helpful and accommodating, going above and beyond to make sure my stay was comfortable. The pool area was beautiful and relaxing, and the on-site restaurant was delicious. The room was spacious, clean, and had all the necessary amenities. The location is great, right on the strip and close to many attractions. I would definitely recommend this hotel to anyone visiting Las Vegas!",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "12/20/2020T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "While the location of Marriott Hotel Vegas was convenient, the room itself was outdated and had a strange smell. The hotel amenities were average, with nothing particularly noteworthy. The staff was friendly, but not particularly helpful. Overall, I would recommend this hotel only for its location.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "11/15/2020T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a great stay at Marriott Hotel Vegas! The hotel was clean and well-maintained, with all the necessary amenities. The breakfast buffet was delicious and offered a variety of options. The staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions. I would definitely recommend this hotel for its value and convenience.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/22/2020T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a wonderful stay at Marriott Hotel Vegas! The room was spacious and comfortable, with all the necessary amenities. The hotel was located near many attractions and restaurants, making it easy to explore the city. The staff was friendly and helpful throughout my stay. Overall, I had a great experience and would highly recommend this hotel to anyone visiting Las Vegas!",
        "rating": 4.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/08/2020T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a terrible experience at Marriott Hotel Vegas. The staff was rude and unhelpful, making my stay very unpleasant. The room was dirty and in need of repairs. I would not recommend this hotel to anyone.",
        "rating": 1,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/07/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Marriott Hotel Vegas is a great place to stay! The location is perfect - right on the strip and close to many attractions. The room was spacious, clean, and comfortable, with all the necessary amenities. The staff was friendly and helpful throughout my stay. The pool area was beautiful and relaxing, and the on-site restaurant was delicious. I would definitely recommend this hotel to anyone visiting Las Vegas!",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "07/15/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "While the room at Marriott Hotel Vegas was clean and comfortable, the hotel amenities were lacking. There was no on-site restaurant or room service, which was disappointing. The staff was friendly and helpful, but it wasn't enough to make up for the lack of amenities. However, the location is great, right on the strip and close to many attractions.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "06/20/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a decent stay at Marriott Hotel Vegas. The room was clean and comfortable, with all the necessary amenities. The staff was friendly and helpful throughout my stay. The hotel amenities were average, with nothing particularly noteworthy. However, the location is great, right on the strip and within walking distance to many attractions.",
        "rating": 3.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/04/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a disappointing stay at Marriott Hotel Vegas. The room was outdated and in need of repairs. The hotel amenities were lacking, with no pool or fitness center. The staff was friendly, but not particularly helpful. However, the location is great, right on the strip and close to many attractions.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/03/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "While the room at Marriott Hotel Vegas was clean and comfortable, the hotel amenities were lacking. There was no pool or fitness center, which was disappointing. The staff was friendly and helpful throughout my stay. However, the location is great, right on the strip and within walking distance to many attractions.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/09/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a great stay at Marriott Hotel Vegas! The room was spacious, clean, and comfortable, with all the necessary amenities. The hotel amenities were top-notch, including the pool, fitness center, and on-site restaurant. The staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions. I would highly recommend this hotel to anyone visiting Las Vegas!",
        "rating": 4.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/10/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had an excellent stay at Marriott Hotel Vegas! The room was spacious, clean, and comfortable, with all the necessary amenities. The hotel amenities were top-notch, including the pool, fitness center, and on-site restaurant. The staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions. I would highly recommend this hotel to anyone visiting Las Vegas!",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/11/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a wonderful stay at Marriott Hotel Vegas! The room was spacious, clean, and comfortable, with all the necessary amenities. The hotel amenities were top-notch, including the pool, fitness center, and on-site restaurant. The staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions. I would highly recommend this hotel to anyone visiting Las Vegas!",
        "rating": 4.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "11/15/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "While the room at Marriott Hotel Vegas was clean and comfortable, the hotel amenities were lacking. There was no on-site restaurant or room service, which was disappointing. The staff was friendly and helpful throughout my stay. However, the location is great, right on the strip and within walking distance to many attractions.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/20/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a pleasant stay at Marriott Hotel Vegas. The room was clean and comfortable, with all the necessary amenities. The hotel amenities were average, with nothing particularly noteworthy. However, the staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions.",
        "rating": 3.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/08/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "My stay at Marriott Hotel Vegas was disappointing. The room was small and outdated, with a noisy air conditioning unit. The hotel amenities were lacking, with no pool or fitness center. The staff was friendly, but not particularly helpful. However, the location is great, right on the strip and within walking distance to many attractions.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/06/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had an amazing stay at Marriott Hotel Vegas! The room was spacious, clean, and comfortable, with all the necessary amenities. The hotel amenities were top-notch, including the pool, fitness center, and on-site restaurant. The staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions. I would highly recommend this hotel to anyone visiting Las Vegas!",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/20/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had a decent stay at Marriott Hotel Vegas. The room was clean and comfortable, with all the necessary amenities. The hotel amenities were average, with nothing particularly noteworthy. However, the staff was friendly and helpful throughout my stay. The location is great, right on the strip and within walking distance to many attractions.",
        "rating": 3.5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/03/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "My stay at Marriott Hotel Vegas was disappointing. The room was small and outdated, with a musty smell. The hotel amenities were lacking, with no pool or fitness center. The staff was friendly, but not particularly helpful. However, the location is great, right on the strip and within walking distance to many attractions.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/02/2021T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "While the location of Marriott Hotel Vegas is great, right on the strip and close to many attractions, the hotel amenities were lacking. The pool was small and crowded, and the fitness center was outdated and in need of repairs. The room was clean and comfortable, with all the necessary amenities. The staff was friendly and helpful throughout my stay. Overall, I would recommend this hotel only for its location.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/15/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I was absolutely delighted with my recent stay at the Marriott. From the moment I checked in, the staff was incredibly welcoming and attentive. The room was a dream - spacious, with a supremely comfortable bed and a stunning view of the Vegas skyline. The cleanliness was impeccable. Dining at the hotel's restaurant was a culinary delight, and the pool area felt like a serene oasis in the bustling city. Can't wait to return!",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "09/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "For the premium price, I expected a bit more. The room was clean but fairly standard, lacking unique amenities. The check-in process was frustratingly slow, and it seemed the staff was struggling to manage the crowd. Additionally, the hotel's parking situation was more complicated than necessary. While the location is convenient for exploring Vegas, overall, it felt like an average experience not matching the high cost.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/22/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott in Vegas was a decent choice for a short business trip. The highlight was the conference facilities, which were well-equipped and comfortable. My room was clean and functional, though not particularly memorable. The Wi-Fi was reliable, which was crucial for my work. However, the in-room dining options were limited and overpriced. It's a solid option for business travelers, but I might look elsewhere for a leisure trip.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "04/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had mixed feelings about my stay at the Marriott. The location is great, right in the heart of Vegas, but my experience was marred by the ongoing construction nearby. It was quite noisy, particularly in the early morning. The room was average, though clean and well-maintained. The staff was friendly, and the breakfast buffet offered a good variety of tasty options. It's a decent hotel, but I hope they can address the noise issue.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/20/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "My stay at the Marriott was nothing short of fantastic. The hotel exudes luxury, and the attention to detail is evident. The room was beautifully furnished, offering comfort and elegance. I was particularly impressed by the spa services - a truly rejuvenating experience. The staff was professional and courteous, always ready to assist. The on-site dining options provided a diverse range of delicious meals. It's the perfect escape for a luxury Vegas experience.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "12/31/2023T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott Hotel in Vegas was a letdown. The room was smaller than expected, the air conditioning was loud, and the bathroom amenities were lacking. The staff was friendly, but overall, it didn't live up to the hype.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I was pleasantly surprised by the Marriott. The room was cozy and well-furnished, and the view of the city was breathtaking. The breakfast buffet had a great selection, and the staff was always helpful.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/29/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Average stay at the Marriott. The room was clean but nothing special. The gym was well-equipped, but the pool was overcrowded. Good for a short business trip, but not for a family vacation.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "03/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "I had an excellent experience at the Marriott. The staff was exceptional, going out of their way to accommodate my needs. The room was luxurious, and the in-house dining was exquisite. Definitely worth the price.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "04/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was a bit of a disappointment. The Wi-Fi was spotty, and the room service was slow and unimpressive. The location is good, but I expected better service and amenities.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A decent stay at the Marriott. The room was comfortable, albeit a bit dated. The staff was friendly and the location convenient for sightseeing. However, the noise level from the hallway was bothersome.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "06/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott in Vegas was fantastic! The room was spacious and elegantly decorated. The rooftop bar had amazing cocktails and a stunning view. The concierge service was also very helpful in planning our outings.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "07/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Not the best experience at the Marriott. The room was not as clean as I would expect, and the staff seemed disinterested. The location is convenient, but overall, it fell short of expectations.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "08/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "An okay stay at the Marriott. The room was standard, nothing extraordinary. The fitness center was a plus, but the restaurant options were limited and pricey.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "09/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Marvelous stay at the Marriott! The suite was breathtaking with a comfortable bed and modern amenities. The staff provided excellent recommendations for local dining and entertainment. Would highly recommend.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was underwhelming. The decor was outdated, and the room felt cramped. The staff was friendly, but it didn't make up for the overall mediocre experience.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "11/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A pleasant surprise at the Marriott. The lobby was elegantly decorated, and the room had a comfortable, modern feel. The pool area was relaxing, and the staff was attentive.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/13/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Mediocre stay at the Marriott. The room was clean, but the bed was uncomfortable. The bar was nice, but it closed early. Suitable for a short stay but not for a vacation.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/14/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Loved my time at the Marriott! The service was outstanding, with staff members always ready to assist. The room was luxurious, and the spa services were top-notch. A truly five-star experience.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/15/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Disappointing experience at the Marriott. The air conditioning was loud, and the room lacked basic amenities like a coffee maker. The staff was courteous but seemed overwhelmed.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/16/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "An average experience at the Marriott. The room was fine, but nothing stood out. The location was convenient for business meetings, but the hotel lacked character.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/17/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Amazing experience at the Marriott! The room had an incredible view, and the bed was like sleeping on a cloud. The breakfast buffet was delicious with a wide variety. Highly recommend.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/18/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Not impressed with the Marriott. The room was not well-maintained, and the bathroom had plumbing issues. The only redeeming factor was its central location.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/19/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was just okay. The room was standard, clean but uninspiring. The gym facilities were good, but the dining options were limited. Suitable for a quick business trip.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/20/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Incredible stay at the Marriott! The staff was extraordinarily helpful, especially with arranging tours. The room was elegant and well-equipped. The dining experience was also remarkable. A perfect stay in Vegas.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/21/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was a fantastic choice. The room was spacious with a comfortable bed and modern tech. Loved the pool area and the fitness center. Staff were always smiling and helpful.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/22/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A bit disappointed with the Marriott this time. The room felt a bit dated and the bathroom had some plumbing issues. The staff were nice but seemed busy.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/23/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Great location, but the Marriott itself was just okay. Room was clean but plain, and the service was average. Good for a business trip but not for a special occasion.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/24/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Loved the Marriott in Vegas! The luxury suite was worth every penny - stunning views and top-notch amenities. The concierge service was exceptional, helping us book amazing shows.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/25/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Not what I expected from the Marriott. The room was noisy and the air conditioning didn't work properly. The staff tried to help but it was a frustrating stay.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/26/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was a good choice for a quick Vegas trip. Efficient check-in, clean rooms, and a nice bar area. However, it lacked the wow factor I was hoping for.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/27/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "An average stay at the Marriott. The room was okay, but the lighting was poor and the decor uninspiring. The staff were friendly, but overall it was a forgettable experience.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/28/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott exceeded my expectations. The room had a fantastic view, the bed was incredibly comfortable, and the amenities were top-notch. The staff were attentive and professional.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/29/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Quite disappointed with the Marriott. The room was smaller than advertised and lacked basic amenities. The staff were polite but not very helpful.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/30/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was a pleasant surprise. The room was beautifully decorated and the bed was very comfortable. The staff were wonderful and made our stay extra special.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/31/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Mediocre experience at the Marriott. The room was clean but had a musty smell, and the service was slow. It's conveniently located, but I expected more.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "01/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott in Vegas was superb. The room was luxurious, the food at the restaurant was delicious, and the staff were incredibly friendly and helpful.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Below expectations for the Marriott. The room was not well cleaned, and the TV was outdated. The staff were nice but seemed overwhelmed with other guests.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "03/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A solid choice in Vegas. The Marriott offered clean, comfortable rooms, although a bit on the smaller side. The staff were efficient and the location was convenient for sightseeing.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "04/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was a bit of a letdown. The room was okay but lacked character, and the service was impersonal. It was clean and functional for a business trip, but I wouldn’t recommend it for a vacation.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "05/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Marriott Vegas was a dream. The suite was spacious and well-appointed, with a breathtaking view. The staff were attentive and the dining options were excellent.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "06/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "An okay stay at the Marriott. The room was clean but unremarkable. The staff were friendly but the hotel lacked the extra touches that make a stay special.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "07/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Disappointing experience at Marriott. The room was not as clean as expected and the service was lackluster. Not up to the usual Marriott standard.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "08/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A delightful stay at the Marriott. The room was elegantly furnished, and the service was impeccable. The pool and spa facilities were a major highlight.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "09/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was satisfactory. The room was basic but clean, and the staff were helpful. Good for a business stay but lacks charm for a holiday.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "10/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott left a lot to be desired. The room felt cramped and outdated, and the service was slow. It’s in a good location, but that’s about it.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "11/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Enjoyed my stay at the Marriott. The room was comfortable and the staff were exceptionally friendly. Great location for exploring Vegas.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "12/01/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was underwhelming. The room was mediocre and the service was average. Not what I expect from a Marriott hotel.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/13/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A good stay at the Marriott. The room was nice, and the hotel is well-located. The staff were polite and helpful, making for a pleasant experience.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/14/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Marriott in Vegas was fantastic. The room was spacious, the food was great, and the staff went out of their way to ensure a great stay.",
        "rating": 5,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/15/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "An average stay at the Marriott. The room was fine, but nothing stood out. The staff were friendly, but the hotel lacked any unique features.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/16/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "Disappointed with the Marriott. The room was cramped, and the service was not up to par. Expected more from a hotel of this caliber.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/17/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A pleasant experience at the Marriott. The room was well-equipped and comfortable. The staff were very accommodating and the location was great.",
        "rating": 4,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/18/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "The Marriott was a letdown. The room was outdated and the bed was uncomfortable. The service was mediocre at best.",
        "rating": 2,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "02/19/2024T00:00:00",
        "locationName": "Marriott Hotel Vegas",
        "desc": "A decent stay at the Marriott. The room was clean and the staff were friendly. It's a good option for those looking for a standard, no-frills hotel stay.",
        "rating": 3,
        "address": "3255 Las Vegas Boulevard South,Las Vegas, Nevada - 89109, United States",
        "country": "USA"
    },
    {
        "date": "12/31/2023T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott in Chicago set a new standard for luxury. The room was stunning with its city views and plush bedding. The staff were incredibly attentive and the on-site restaurant was divine. A truly unforgettable experience.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "While the location of the JW Marriott is excellent, my room felt a bit outdated. The service was good, but for the price, I expected a bit more modern amenities.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/29/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Had an average stay at JW Marriott. The room was clean and comfortable, but nothing extraordinary. The lobby was beautifully decorated though.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "03/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A disappointing experience at JW Marriott. The room was smaller than expected and quite noisy. The staff was polite but seemed overwhelmed.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "04/30/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott impressed me with its elegant ambiance and exceptional service. The room was luxurious and the fitness center was well-equipped. Will definitely return.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "05/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott was decent, but not spectacular. The room was clean but lacked character. The staff were friendly and the location is great for downtown Chicago.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "06/30/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I was delighted with my stay at the JW Marriott. The room was beautifully appointed, and the staff went above and beyond to ensure a comfortable stay.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "07/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "My stay at the JW Marriott was underwhelming. The room felt cramped and the bathroom amenities were just average. Expected more from a luxury hotel.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "08/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A pleasant stay at JW Marriott. The room was cozy and the bed was extremely comfortable. The staff were very accommodating and the location was perfect for sightseeing.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "09/30/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott was a letdown. The room was not well-maintained and had a musty smell. The service was okay but not up to the mark for a hotel of this stature.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "10/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "An enjoyable stay at the JW Marriott. The room was spacious and well-furnished. The staff were friendly and helpful, making our stay comfortable.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "11/30/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott was a mixed bag. The room was nice, but the air conditioning was very loud. The location is great for exploring the city.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/13/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I had a fantastic stay at JW Marriott. The room was elegant and the service was top-notch. The hotel's restaurant offered some of the best meals I've had.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/14/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A disappointing stay at JW Marriott. The room felt outdated and the Wi-Fi was unreliable. Not what I expected from a high-end hotel.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/15/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott was satisfactory. The room was standard, clean, but nothing special. The staff were polite and the location was convenient for business meetings.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/16/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott exceeded my expectations. The room was spacious with a fantastic city view. The staff were exceptionally welcoming and the dining experience was superb.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/17/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A decent stay at the JW Marriott. The room was clean but a bit plain. The gym was well-equipped and the staff were helpful.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/18/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Not impressed with JW Marriott. The room was small and the service was just average. Expected more from such a renowned hotel.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/19/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A wonderful experience at JW Marriott. The luxury suite was absolutely stunning. The staff's attention to detail made our stay special.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/20/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott was okay, but not great. The room was fine, but the overall ambiance of the hotel was lacking. The staff were nice though.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/21/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Loved my stay at the JW Marriott. The room was beautifully decorated, and the bed was incredibly comfortable. The staff were very attentive.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/22/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "An underwhelming experience at JW Marriott. The room was dated and the bathroom needed better cleaning. For the price, I expected more.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/23/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A good stay at JW Marriott. The room was quiet and comfortable. The location is perfect for exploring downtown Chicago.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/24/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I was disappointed with JW Marriott. The room service was slow and the room lacked basic amenities. Not the luxury experience I hoped for.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/25/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A solid choice in Chicago. The JW Marriott offered a comfortable room and friendly service. The restaurant on-site was also quite good.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/26/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott was a bit of a letdown. The room was not as clean as I would have liked, and the staff seemed distracted.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/27/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Enjoyed my time at the JW Marriott. The room was spacious, and the hotel's amenities were great. The staff were very professional.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/28/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott was fantastic. The room was luxurious and the staff were extremely accommodating. The location made it easy to explore the city.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/29/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "An average stay at JW Marriott. The room was clean but lacked personality. The staff were friendly but not particularly engaging.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/30/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott didn't meet my expectations. The room felt cramped and the amenities were just okay. The staff did their best, but it wasn't enough.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/31/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott in Chicago was a delight. The room had an elegant décor, and the view of the city was mesmerizing. The staff were incredibly attentive and the restaurant's cuisine was outstanding.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "My stay at JW Marriott was satisfactory. The room was clean but somewhat unremarkable. The staff were friendly, but the overall experience lacked a wow factor.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Disappointed with JW Marriott. The room felt cramped and the service was below par for a hotel of this stature. The location was the only redeeming feature.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "03/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott offered a luxurious experience. The room was beautifully furnished and the bed was incredibly comfortable. The staff went out of their way to ensure a memorable stay.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "04/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "An average experience at JW Marriott. The room was functional but lacked character. The staff were polite, but the service was nothing extraordinary.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "05/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Really enjoyed my stay at JW Marriott. The room was spacious and well-appointed, and the staff were exceptionally courteous and helpful.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "06/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott was a letdown. The room was not as clean as I would have liked and the amenities were just adequate. The staff were friendly, however.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "07/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A pleasant stay at JW Marriott. The room was comfortable and quiet, perfect for a good night's sleep. The staff were helpful and the location was convenient.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "08/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Not quite up to standard at JW Marriott. The room was small and the furnishings were dated. The staff did their best, but the facilities didn't impress.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "09/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A good stay at JW Marriott. The room was clean and the bed was comfortable. The staff were friendly and the downtown location was ideal.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "10/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott fell short of expectations. The room was mediocre and lacked the luxury feel. The staff were nice but couldn't make up for the other shortcomings.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "11/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I had a great time at JW Marriott. The room was well-furnished and the service was excellent. The location is perfect for exploring Chicago.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "12/01/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott in Chicago was amazing. The room was spacious and luxurious, and the staff were extremely attentive and kind.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/13/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A decent stay at JW Marriott. The room was clean, though a bit plain. The staff were friendly, but nothing stood out as exceptional.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/14/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott was somewhat disappointing. The room was not as upscale as I hoped and the service was just average. Expected more from a JW Marriott hotel.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/15/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "My experience at JW Marriott was outstanding. The room was exceptionally clean and well-maintained, offering a stunning city view. The staff were attentive and professional, making my stay very comfortable.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/16/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "An okay experience at JW Marriott. The room was standard, nothing special. The location is great for downtown activities, but the hotel itself didn't impress much.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/17/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Disappointed with my stay at JW Marriott. The room was quite small and felt stuffy. The staff were courteous but seemed busy.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/18/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I had a wonderful stay at the JW Marriott. The room was beautifully decorated, the amenities were excellent, and the staff were incredibly helpful and friendly.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/19/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "The JW Marriott was average. The room was clean but lacked personality. The service was good, but I expected something more memorable for the price.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/20/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott didn't live up to my expectations. The room was outdated and the service was mediocre. The location is convenient, but that's about it.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/21/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I enjoyed my stay at JW Marriott. The room was spacious, and the staff were very attentive and kind. The central location was perfect for my needs.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/22/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "Not very impressed with JW Marriott. The room was small and the decor was unimpressive. The staff were friendly, but the overall experience was lacking.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/23/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A good experience at JW Marriott. The room was comfortable, and the staff were quite helpful. The location is great for exploring downtown Chicago.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/24/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott was fantastic. The room was luxurious, and the service was top-notch. The dining options in the hotel were also impressive.",
        "rating": 5,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/25/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A mediocre experience at JW Marriott. The room was fine but nothing exceptional. The staff were pleasant but not very engaging.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/26/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "I was let down by JW Marriott. The room was cramped and the amenities were lacking. The staff tried their best, but the overall experience wasn't great.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/27/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "A pleasant stay at JW Marriott. The room was nicely appointed and the bed was very comfortable. The staff were friendly and the location was ideal for business and leisure.",
        "rating": 4,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "02/28/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott in Chicago was a bit of a disappointment. The room was not up to the expected standard and the service was just okay.",
        "rating": 2,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "01/02/2024T00:00:00",
        "locationName": "JW Marriott Chicago",
        "desc": "JW Marriott was a decent choice. The room was clean and comfortable, although nothing extraordinary. The staff were courteous and helpful.",
        "rating": 3,
        "address": "151 W Adams St,Chicago, IL 60603, United States",
        "country": "USA"
    },
    {
        "date": "12/31/2023T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "The JW Marriott in San Diego was a treat. The ocean view from my room was breathtaking. The staff were incredibly hospitable and the dining options were excellent. The pool area was a perfect spot to relax.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/31/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A good stay at JW Marriott. The room was clean and well-maintained, though a bit standard. Excellent location near the beach and local attractions.",
        "rating": 4,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "02/29/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Average experience at JW Marriott. The room was okay but nothing special. The service was decent, but I expected more from a Marriott hotel.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "03/31/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Disappointed with my stay at JW Marriott. The room was smaller than expected and a bit outdated. The staff were friendly but the facilities didn't live up to expectations.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "04/30/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott offered a superb experience. The room was elegant and the bed was incredibly comfortable. The staff went out of their way to make our stay special.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "05/31/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "An okay visit to JW Marriott. The room was clean but lacked character. The staff were polite and the location is convenient for exploring San Diego.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "06/30/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "I was really impressed with JW Marriott. The room was luxurious with stunning views. The amenities, including the spa, were top-notch.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "07/31/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "The JW Marriott was a bit underwhelming. The room felt cramped and not very well-lit. The staff were kind, but overall, it was a mediocre experience.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "08/31/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A pleasant stay at JW Marriott. The room was cozy and the staff were very accommodating. Great location for beach access.",
        "rating": 4,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "09/30/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Not too impressed with JW Marriott. The room was average and the air conditioning was noisy. Good location, but the hotel itself didn't stand out.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "10/31/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Enjoyed my time at JW Marriott. The room was spacious with a comfortable bed. The staff were friendly and the on-site restaurant was great.",
        "rating": 4,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "11/30/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott was a mixed experience. Loved the location and the lobby decor, but the room was just okay and a bit overpriced.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/13/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Had a fantastic stay at JW Marriott. The service was exceptional, and the room was beautifully decorated with all modern amenities.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/14/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A disappointing stay at JW Marriott. The room wasn't as clean as I'd like and the service was subpar. Expected more from a Marriott.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/15/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A decent stay at JW Marriott. The room was clean, and the staff were quite friendly. The location is great, close to many San Diego attractions.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/16/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott in San Diego was outstanding. The room had a spectacular view, and the amenities were top-class. The staff were very attentive and helpful.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/17/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A good, but not great, stay at JW Marriott. The room was clean and comfortable, but lacked some expected luxury touches. The location is excellent, though.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/18/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Slightly disappointed with JW Marriott. The room was not as spacious as I had hoped and the décor was dated. The staff were friendly, however.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/19/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "I had a wonderful experience at JW Marriott. The room was immaculate and stylish. The staff were incredibly friendly and the dining was superb.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/20/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott was okay for a short stay. The room was fine, but nothing to write home about. Staff were helpful and polite.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/21/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Not very impressed with JW Marriott. The room felt cramped and the furnishings were a bit old. The service was good, but overall, it lacked the wow factor.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/22/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Enjoyed my stay at JW Marriott. The room was spacious and the service was excellent. Great location for a San Diego visit.",
        "rating": 4,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/23/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Underwhelmed by JW Marriott. The room was mediocre and the bathroom could have been cleaner. The staff were nice but couldn't make up for the room's shortcomings.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/24/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A pleasant experience at JW Marriott. The room was well-appointed and the staff were very attentive. The location is perfect for enjoying San Diego's attractions.",
        "rating": 4,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/25/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott was fantastic. The room was luxurious, and the staff went above and beyond to ensure a great stay. Highly recommend.",
        "rating": 5,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/26/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "An average experience at JW Marriott. The room was clean but nothing special. The staff were friendly and helpful, but the hotel didn't stand out.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/27/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "Disappointed with JW Marriott. The room was not up to the standard I expected and the service was lackluster. Not the best experience.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/28/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "A very comfortable stay at JW Marriott. The room was elegant and the staff were extremely welcoming. Great location near the beach.",
        "rating": 4,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/29/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott in San Diego was a letdown. The room was small and the amenities were just okay. The service was fine, but not exceptional.",
        "rating": 2,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    },
    {
        "date": "01/30/2024T00:00:00",
        "locationName": "JW Marriott San Diego",
        "desc": "JW Marriott was a decent choice. The room was clean and the staff were quite friendly. Good location for exploring the city.",
        "rating": 3,
        "address": "333 W Harbor Dr,San Diego, CA 92101, United States",
        "country": "USA"
    }
]